#include <stdbool.h>
//25. (**) Визначити, чи є ціле 6-значне число “щасливим” квитком (“щасливий квиток” – квиток, якому сума першої половини чисел номера дорівнює сумі другої половини. Наприклад, білет з номером 102300 є щасливим, бо 1 + 0 + 2 = 3 + 0 + 0.
int main() {
    int ticket1 = 10222300; // Щасливий (1+0+2 = 3, 3+0+0 = 3)
    int ticket2 = 456123; // Нещасливий (4+5+6 = 15, 1+2+3 = 6)
	int  a = 0 ;
	int first_half = ticket1 / 10000;
    int sum_first_half = (first_half / 1000) +          // сотні тисяч
                         ((first_half / 100) % 10) +    // десятки тисяч
                         ((first_half / 10) % 10)  + (first_half % 10) ;           // тисячі

    // 2. Обчислення суми останніх трьох цифр (молодша половина)
    // Використовуємо залишок від ділення на 1000, щоб отримати останні 3 цифри.
    int second_half = ticket1 % 10000;
    int sum_second_half = (second_half / 1000) +        // сотні
                          ((second_half / 100) % 10) +  // десятки
                          ((second_half /10) % 10) + (second_half % 10) ;         // одиниці
	if (sum_first_half == sum_second_half)  {
		a = 1 ;
	 }
	 else {
		a = 0 ;
	 }
	
    // Результати зберігаються у змінних
    bool voop1 = a;  
    return 0; 
}
