#include <stdbool.h>
//25. (**) Визначити, чи є ціле 6-значне число “щасливим” квитком (“щасливий квиток” – квиток, якому сума першої половини чисел номера дорівнює сумі другої половини. Наприклад, білет з номером 102300 є щасливим, бо 1 + 0 + 2 = 3 + 0 + 0.
bool lucky_ticket(int number){
    // 1. Обчислення суми перших трьох цифр (старша половина)
    // Використовуємо ділення на 1000, щоб відкинути останні 3 цифри.
    int first_half = number / 1000;
    int sum_first_half = (first_half / 100) +          // сотні тисяч
                         ((first_half / 10) % 10) +    // десятки тисяч
                         (first_half % 10);            // тисячі

    // 2. Обчислення суми останніх трьох цифр (молодша половина)
    // Використовуємо залишок від ділення на 1000, щоб отримати останні 3 цифри.
    int second_half = number % 1000;
    int sum_second_half = (second_half / 100) +        // сотні
                          ((second_half / 10) % 10) +  // десятки
                          (second_half % 10);          // одиниці
     // 3. Порівняння сум
    return sum_first_half == sum_second_half;                     

}
int main() {
    int ticket1 = 102300; // Щасливий (1+0+2 = 3, 3+0+0 = 3)
    int ticket2 = 456123; // Нещасливий (4+5+6 = 15, 1+2+3 = 6)
    
    // Результати зберігаються у змінних
    bool voop1 = lucky_ticket(ticket1); 
    bool voop2 = lucky_ticket(ticket2); 
    return 0; 
}
