/**
 * @file lib.h
 * @brief Заголовковий файл з математичною логікою для лабораторної роботи №11.
 * @author Шепеля Ярослав
 * @date 2026-03-30
 */

#ifndef LIB_H
#define LIB_H

/**
 * @brief Знаходить зворотню матрицю методом Гауса-Жордана.
 *
 * @param mat Покажчик на одновимірний масив, що представляє вхідну матрицю.
 * @param inv Покажчик на одновимірний масив, куди буде записано результат.
 * @param n Розмірність матриці (кількість рядків/стовпців).
 * @return 0, якщо матрицю успішно обчислено, або 1, якщо матриця вироджена.
 */
int invert_matrix(float *mat, float *inv, int n);

#endif