int main(){
	int k[1000] = {0}; // наший масив 
	int index = 0; // індексація для додавання в масив щасливих квитків
	int i = 0; // лічильник
	for (i=1000; i<=9999; i++ ){ // цикл для обрахування чи щасливий квиток
		int sum_first_half = (i/100/10) + (i/100%10); // сума першої половини
		int sum_second_half = (i%100/10) + (i%100%10); // сума другої половини
		if (sum_first_half == sum_second_half) { // перевірка чи сума першої = сумі другої
			k[index++] = i ; // в разі істини додавання елемента в цикл
		} 
	}
	return 0;
}