//23. (**) Визначити, чи є задане ціле число простим.
int main() {
    int n= 5 ;
	int i;
	//Перевірка для  n чи воно від'ємне
	 if (n < 0) {
        return 2; // 2 = дане число від'ємне
    }
    // Перевірка для  n чи воно  дорівнює 0 або 1.
    if (n <= 1) {
        return 1; // 1 = не просте
    }
    // Перевірка для  n  чи воно дорівнює 2 і 3 бо вони є простими числами.
    if (n <= 3) {
        return 0; // 0 = просте
    }
    // Перевірка n y всіх парних випадках
    if (n % 2 == 0) {
        return 1;
    }
    // Перевіряємо непарні дільники від 3 до кореня n .
    // Використовуємо як умову перевірки i * i <= n для запуску циклу.
    for ( i = 3;	 i * i <= n; i += 2) {
        if (n % i == 0) {
            return 1; // Знайдено дільник, число не є простим
        }
    }
    // Якщо дільників не знайдено, число є простим.
    return 0; // 0 = просте
}