/**
 * @file lib.h
 * @brief Заголовковий файл з оголошенням математичної логіки.
 * @author Шепеля Ярослав (КН-925а)
 */

#ifndef LIB_H
#define LIB_H

/**
 * @brief Підраховує частоту появи кожного символу в заданому рядку.
 * * Ця функція проходить по вхідному рядку і заповнює масив із 256 елементів 
 * (відповідно до таблиці ASCII), де кожен індекс відповідає коду символу.
 * Символ перенесення рядка ('\n') ігнорується.
 * * @param str Вказівник на нуль-термінований рядок для аналізу.
 * @param freq Вказівник на масив цілих чисел (розміром 256) для збереження частот.
 * @param total_chars Вказівник на змінну, куди буде записана загальна кількість підрахованих символів.
 */
void calc_frequency(const char *str, int *freq, int *total_chars);

#endif